src/Documents/GeneralJournalEntry.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>GeneralJournalEntry</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotalRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTotal</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DueDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ARorAP</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GeneralJournalEntryTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Account</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountDescription</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountDr</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AmountCr</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Memo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Counterparty</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccountingRegisters/GeneralJournal.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccountingRegister>
		<Properties>
			<Name>GeneralJournal</Name>
			<ChartOfAccounts>ChartOfAccounts.ChartOfAccounts</ChartOfAccounts>
			<Correspondence>false</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AmountRC</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/Enums/AccountTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>AccountTypes</Name>
			<Comment>Oredered by balance sections</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Bank</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Inventory</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountsReceivable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FixedAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccumulatedDepreciation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherNonCurrentAsset</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AccountsPayable</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherCurrentLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>LongTermLiability</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Equity</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Income</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CostOfSales</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expense</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherIncome</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OtherExpense</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ChartsOfAccounts/ChartOfAccounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<ChartOfAccounts>
		<Properties>
			<Name>ChartOfAccounts</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.Dimensions</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AccountType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AccountTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category1099</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.USTaxCategories1099</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OtherComprehensiveIncome</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncomeTaxAccount</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashFlowSection</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashFlowSections</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Noncash</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

src/Documents/GeneralJournalEntry/Ext/ObjectModule.bsl
// The procedure creates a GJ entry transaction
//
Procedure Posting(Cancel, Mode)
		   
	CounterpartiesPresent = False;
	For Each CurRowLineItems In LineItems Do
		If CurRowLineItems.Counterparty <> Catalogs.Counterparties.EmptyRef() Then
			CounterpartiesPresent = True;	
		EndIf;
	EndDo;
	
	OneARorAPLine = False;
	If CounterpartiesPresent = True Then
		For Each CurRowLineItems In LineItems Do
			If (CurRowLineItems.Account.AccountType <> Enums.AccountTypes.AccountsPayable AND
				CurRowLineItems.Account.AccountType <> Enums.AccountTypes.AccountsReceivable) AND
					CurRowLineItems.Counterparty <> Catalogs.Counterparties.EmptyRef() Then
			OneARorAPLine = True;	
			EndIf;
		EndDo;
	EndIf;
	
	RegisterRecords.GeneralJournal.Write = True;
	
	// scenario 1 - counterparties present, one or more A/R, A/P lines, one other line
	If CounterpartiesPresent = True AND OneARorAPLine = False Then
		
		For Each CurRowLineItems In LineItems Do
			
			If CurRowLineItems.AmountDr > 0 Then
			
			 	Record = RegisterRecords.GeneralJournal.AddDebit();
				Record.Account = CurRowLineItems.Account;
				If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
					Record.Currency = Record.Account.Currency;
				EndIf;	
				Record.Period = Date;
				If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
					Record.Amount = CurRowLineItems.AmountDr;
				EndIf;
				Record.AmountRC = CurRowLineItems.AmountDr * ExchangeRate;
				Record.Memo = CurRowLineItems.Memo;
				
				If CurRowLineItems.Counterparty <> Catalogs.Counterparties.EmptyRef() Then
					Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Counterparty] = CurRowLineItems.Counterparty;
					Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Document] = Ref;
				EndIf;

			Else
			
				Record = RegisterRecords.GeneralJournal.AddCredit();
				Record.Account = CurRowLineItems.Account;
				If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
					Record.Currency = Record.Account.Currency;
				EndIf;	
				Record.Period = Date;
				If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
					Record.Amount = CurRowLineItems.AmountCr;
				EndIf;
				Record.AmountRC = CurRowLineItems.AmountCr * ExchangeRate;
				Record.Memo = CurRowLineItems.Memo;
				
				If CurRowLineItems.Counterparty <> Catalogs.Counterparties.EmptyRef() Then
					Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Counterparty] = CurRowLineItems.Counterparty;
					Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Document] = Ref;
				EndIf;
			
			EndIf;
			
		EndDo;
	EndIf;
	
	// scenario 2 - counterparties present, one A/R or A/P line, multiple other lines
	
	TransactionARorAPAccount = ChartsOfAccounts.ChartOfAccounts.EmptyRef();
	For Each CurRowLineItems In LineItems Do
		If CurRowLineItems.Account.AccountType = Enums.AccountTypes.AccountsPayable OR
			CurRowLineItems.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
				TransactionARorAPAccount = CurRowLineItems.Account;	
		EndIf;
	EndDo;
	
	If CounterpartiesPresent = True AND OneARorAPLine = True Then
		
		For Each CurRowLineItems In LineItems Do
			
			If CurRowLineItems.Account.AccountType <> Enums.AccountTypes.AccountsPayable AND
				CurRowLineItems.Account.AccountType <> Enums.AccountTypes.AccountsReceivable Then
			
				If CurRowLineItems.AmountDr > 0 Then
				
				 	Record = RegisterRecords.GeneralJournal.AddDebit();
					Record.Account = CurRowLineItems.Account;
					If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
						Record.Currency = Record.Account.Currency;
					EndIf;	
					Record.Period = Date;
					If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
						Record.Amount = CurRowLineItems.AmountDr;
					EndIf;
					Record.AmountRC = CurRowLineItems.AmountDr * ExchangeRate;
					Record.Memo = CurRowLineItems.Memo;
					
					Record = RegisterRecords.GeneralJournal.AddCredit();
					Record.Account = TransactionARorAPAccount;
					If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
						Record.Currency = Record.Account.Currency;
					EndIf;	
					Record.Period = Date;
					If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
						Record.Amount = CurRowLineItems.AmountDr;
					EndIf;
					Record.AmountRC = CurRowLineItems.AmountDr * ExchangeRate;
					Record.Memo = CurRowLineItems.Memo;
					
					Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Counterparty] = CurRowLineItems.Counterparty;
					Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Document] = Ref;

				Else
				
					Record = RegisterRecords.GeneralJournal.AddCredit();
					Record.Account = CurRowLineItems.Account;
					If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
						Record.Currency = Record.Account.Currency;
					EndIf;	
					Record.Period = Date;
					If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
						Record.Amount = CurRowLineItems.AmountCr;
					EndIf;
					Record.AmountRC = CurRowLineItems.AmountCr * ExchangeRate;
					Record.Memo = CurRowLineItems.Memo;
					
					Record = RegisterRecords.GeneralJournal.AddDebit();
					Record.Account = TransactionARorAPAccount;
					If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
						Record.Currency = Record.Account.Currency;
					EndIf;	
					Record.Period = Date;
					If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
						Record.Amount = CurRowLineItems.AmountDr;
					EndIf;
					Record.AmountRC = CurRowLineItems.AmountCr * ExchangeRate;
					Record.Memo = CurRowLineItems.Memo;

					Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Counterparty] = CurRowLineItems.Counterparty;
					Record.ExtDimensions[ChartsOfCharacteristicTypes.Dimensions.Document] = Ref;
				
				EndIf;
				
			EndIf;
			
		EndDo;
	EndIf;

	
	// scenario 3 - basic transaction, no counterparties present
	If CounterpartiesPresent = False Then 
	
		For Each CurRowLineItems In LineItems Do
			
			If CurRowLineItems.AmountDr > 0 Then
			
			 	Record = RegisterRecords.GeneralJournal.AddDebit();
				Record.Account = CurRowLineItems.Account;
				If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
					Record.Currency = Record.Account.Currency;
				EndIf;	
				Record.Period = Date;
				If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
					Record.Amount = CurRowLineItems.AmountDr;
				EndIf;
				Record.AmountRC = CurRowLineItems.AmountDr * ExchangeRate;
				Record.Memo = CurRowLineItems.Memo;

			Else
			
				Record = RegisterRecords.GeneralJournal.AddCredit();
				Record.Account = CurRowLineItems.Account;
				If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
					Record.Currency = Record.Account.Currency;
				EndIf;	
				Record.Period = Date;
				If Record.Account.AccountType = Enums.AccountTypes.Bank OR Record.Account.AccountType = Enums.AccountTypes.AccountsPayable OR Record.Account.AccountType = Enums.AccountTypes.AccountsReceivable Then
					Record.Amount = CurRowLineItems.AmountCr;
				EndIf;
				Record.AmountRC = CurRowLineItems.AmountCr * ExchangeRate;
				Record.Memo = CurRowLineItems.Memo;
			
			EndIf;
			
		EndDo;
		
	EndIf;

EndProcedure
